tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18854_tdd.h
#define CM2PSEL_PCH                   2765
#define C2PCH                         2766
#define C2PCH0                        2767
#define CM2PSEL_PCH0                  2768
#define C2PCH1                        2769
#define CM2PSEL_PCH1                  2770
#define CM2PSEL_PCH2                  2771
#define C2PCH2                        2772
#define CLCDATA                       2773
#define MLC1OUT                       2774
#define MLC2OUT                       2775
#define MLC3OUT                       2776
#define MLC4OUT                       2777
#define CLC1CON                       2778
#define CLC1CON_MODE                  2779
#define LC1MODE0                      2780
#define LC1MODE                       2781
#define CLC1CON_MODE0                 2782
#define LC1MODE1                      2783
#define CLC1CON_MODE1                 2784
#define LC1MODE2                      2785
#define CLC1CON_MODE2                 2786
#define LC1INTN                       2787
#define CLC1CON_INTN                  2788
#define LC1INTP                       2789
#define CLC1CON_INTP                  2790
#define LC1OUT                        2791
#define CLC1CON_OUT                   2792
#define LC1EN                         2793
#define CLC1CON_EN                    2794
#define CLC1POL                       2795
#define LC1G1POL                      2796
#define CLC1POL_G1POL                 2797
#define CLC1POL_G2POL                 2798
#define LC1G2POL                      2799
#define LC1G3POL                      2800
#define CLC1POL_G3POL                 2801
#define LC1G4POL                      2802
#define CLC1POL_G4POL                 2803
#define CLC1POL_POL                   2804
#define LC1POL                        2805
#define CLC1SEL0                      2806
#define LC1D1S                        2807
#define CLC1SEL0_D1S0                 2808
#define LC1D1S0                       2809
#define CLC1SEL0_D1S                  2810
#define CLC1SEL0_D1S1                 2811
#define LC1D1S1                       2812
#define CLC1SEL0_D1S2                 2813
#define LC1D1S2                       2814
#define CLC1SEL0_D1S3                 2815
#define LC1D1S3                       2816
#define LC1D1S4                       2817
#define CLC1SEL0_D1S4                 2818
#define CLC1SEL0_D1S5                 2819
#define LC1D1S5                       2820
#define LC1D1S6                       2821
#define CLC1SEL0_D1S6                 2822
#define LC1D1S7                       2823
#define CLC1SEL0_D1S7                 2824
#define CLC1SEL1                      2825
#define CLC1SEL1_D2S                  2826
#define CLC1SEL1_D2S0                 2827
#define LC1D2S0                       2828
#define LC1D2S                        2829
#define CLC1SEL1_D2S1                 2830
#define LC1D2S1                       2831
#define CLC1SEL1_D2S2                 2832
#define LC1D2S2                       2833
#define CLC1SEL1_D2S3                 2834
#define LC1D2S3                       2835
#define LC1D2S4                       2836
#define CLC1SEL1_D2S4                 2837
#define D2S5                          2838
#define LC1D2S5                       2839
#define LC1D2S6                       2840
#define CLC1SEL1_D2S6                 2841
#define CLC1SEL1_D2S7                 2842
#define LC1D2S7                       2843
#define CLC1SEL2                      2844
#define CLC1SEL2_D3S                  2845
#define LC1D3S0                       2846
#define LC1D3S                        2847
#define CLC1SEL2_D3S0                 2848
#define LC1D3S1                       2849
#define CLC1SEL2_D3S1                 2850
#define LC1D3S2                       2851
#define CLC1SEL2_D3S2                 2852
#define LC1D3S3                       2853
#define CLC1SEL2_D3S3                 2854
#define LC1D3S4                       2855
#define CLC1SEL2_D3S4                 2856
#define LC1D3S5                       2857
#define CLC1SEL2_D3S5                 2858
#define LC1D3S6                       2859
#define CLC1SEL2_D3S6                 2860
#define LC1D3S7                       2861
#define CLC1SEL2_D3S7                 2862
#define CLC1SEL3                      2863
#define LC1D4S                        2864
#define CLC1SEL3_D4S                  2865
#define LC1D4S0                       2866
#define CLC1SEL3_D4S0                 2867
#define LC1D4S1                       2868
#define CLC1SEL3_D4S1                 2869
#define LC1D4S2                       2870
#define CLC1SEL3_D4S2                 2871
#define LC1D4S3                       2872
#define CLC1SEL3_D4S3                 2873
#define LC1D4S4                       2874
#define CLC1SEL3_D4S4                 2875
#define LC1D4S5                       2876
#define CLC1SEL3_D4S5                 2877
#define LC1D4S6                       2878
#define CLC1SEL3_D4S6                 2879
#define LC1D4S7                       2880
#define CLC1SEL3_D4S7                 2881
#define CLC1GLS0                      2882
#define CLC1GLS0_D1N                  2883
#define LC1G1D1N                      2884
#define CLC1GLS0_D1T                  2885
#define LC1G1D1T                      2886
#define LC1G1D2N                      2887
#define CLC1GLS0_D2N                  2888
#define LC1G1D2T                      2889
#define CLC1GLS0_D2T                  2890
#define CLC1GLS0_D3N                  2891
#define LC1G1D3N                      2892
#define CLC1GLS0_D3T                  2893
#define LC1G1D3T                      2894
#define CLC1GLS0_D4N                  2895
#define LC1G1D4N                      2896
#define CLC1GLS0_D4T                  2897
#define LC1G1D4T                      2898
#define CLC1GLS1                      2899
#define CLC1GLS1_D1N                  2900
#define LC1G2D1N                      2901
#define LC1G2D1T                      2902
#define CLC1GLS1_D1T                  2903
#define CLC1GLS1_D2N                  2904
#define LC1G2D2N                      2905
#define LC1G2D2T                      2906
#define CLC1GLS1_D2T                  2907
#define CLC1GLS1_D3N                  2908
#define LC1G2D3N                      2909
#define LC1G2D3T                      2910
#define CLC1GLS1_D3T                  2911
#define CLC1GLS1_D4N                  2912
#define LC1G2D4N                      2913
#define LC1G2D4T                      2914
#define CLC1GLS1_D4T                  2915
#define CLC1GLS2                      2916
#define CLC1GLS2_D1N                  2917
#define LC1G3D1N                      2918
#define LC1G3D1T                      2919
#define CLC1GLS2_D1T                  2920
#define LC1G3D2N                      2921
#define CLC1GLS2_D2N                  2922
#define LC1G3D2T                      2923
#define CLC1GLS2_D2T                  2924
#define CLC1GLS2_D3N                  2925
#define LC1G3D3N                      2926
#define LC1G3D3T                      2927
#define CLC1GLS2_D3T                  2928
#define LC1G3D4N                      2929
#define CLC1GLS2_D4N                  2930
#define LC1G3D4T                      2931
#define CLC1GLS2_D4T                  2932
#define CLC1GLS3                      2933
#define LC1G4D1N                      2934
#define CLC1GLS3_G4D1N                2935
#define LC1G4D1T                      2936
#define CLC1GLS3_G4D1T                2937
#define CLC1GLS3_G4D2N                2938
#define LC1G4D2N                      2939
#define CLC1GLS3_G4D2T                2940
#define LC1G4D2T                      2941
#define LC1G4D3N                      2942
#define CLC1GLS3_G4D3N                2943
#define LC1G4D3T                      2944
#define CLC1GLS3_G4D3T                2945
#define CLC1GLS3_G4D4N                2946
#define LC1G4D4N                      2947
#define CLC1GLS3_G4D4T                2948
#define LC1G4D4T                      2949
#define CLC2CON                       2950
#define LC2MODE0                      2951
#define CLC2CON_MODE                  2952
#define LC2MODE                       2953
#define CLC2CON_MODE0                 2954
#define LC2MODE1                      2955
#define CLC2CON_MODE1                 2956
#define LC2MODE2                      2957
#define CLC2CON_MODE2                 2958
#define LC2INTN                       2959
#define CLC2CON_INTN                  2960
#define LC2INTP                       2961
#define CLC2CON_INTP                  2962
#define CLC2CON_OUT                   2963
#define LC2OUT                        2964
#define CLC2CON_EN                    2965
#define LC2EN                         2966
#define CLC2POL                       2967
#define LC2G1POL                      2968
#define CLC2POL_G1POL                 2969
#define LC2G2POL                      2970
#define CLC2POL_G2POL                 2971
#define LC2G3POL                      2972
#define CLC2POL_G3POL                 2973
#define LC2G4POL                      2974
#define CLC2POL_G4POL                 2975
#define CLC2POL_POL                   2976
#define LC2POL                        2977
#define CLC2SEL0                      2978
#define CLC2SEL0_D1S                  2979
#define LC2D1S                        2980
#define LC2D1S0                       2981
#define CLC2SEL0_D1S0                 2982
#define LC2D1S1                       2983
#define CLC2SEL0_D1S1                 2984
#define LC2D1S2                       2985
#define CLC2SEL0_D1S2                 2986
#define LC2D1S3                       2987
#define CLC2SEL0_D1S3                 2988
#define LC2D1S4                       2989
#define CLC2SEL0_D1S4                 2990
#define LC2D1S5                       2991
#define CLC2SEL0_D1S5                 2992
#define LC2D1S6                       2993
#define CLC2SEL0_D1S6                 2994
#define LC2D1S7                       2995
#define CLC2SEL0_D1S7                 2996
#define CLC2SEL1                      2997
#define LC2D2S0                       2998
#define LC2D2S                        2999
#define CLC2SEL1_D2S                  3000
#define CLC2SEL1_D2S0                 3001
#define LC2D2S1                       3002
#define CLC2SEL1_D2S1                 3003
#define LC2D2S2                       3004
#define CLC2SEL1_D2S2                 3005
#define LC2D2S3                       3006
#define CLC2SEL1_D2S3                 3007
#define LC2D2S4                       3008
#define CLC2SEL1_D2S4                 3009
#define LC2D2S5                       3010
#define CLC2SEL1_D2S5                 3011
#define LC2D2S6                       3012
#define CLC2SEL1_D2S6                 3013
#define LC2D2S7                       3014
#define CLC2SEL1_D2S7                 3015
#define CLC2SEL2                      3016
#define CLC2SEL2_D3S0                 3017
#define LC2D3S                        3018
#define CLC2SEL2_D3S                  3019
#define LC2D3S0                       3020
#define CLC2SEL2_D3S1                 3021
#define LC2D3S1                       3022
#define CLC2SEL2_D3S2                 3023
#define LC2D3S2                       3024
#define CLC2SEL2_D3S3                 3025
#define LC2D3S3                       3026
#define CLC2SEL2_D3S4                 3027
#define LC2D3S4                       3028
#define CLC2SEL2_D3S5                 3029
#define LC2D3S5                       3030
#define CLC2SEL2_D3S6                 3031
#define LC2D3S6                       3032
#define CLC2SEL2_D3S7                 3033
#define LC2D3S7                       3034
#define CLC2SEL3                      3035
#define LC2D4S                        3036
#define CLC2SEL3_D4S0                 3037
#define LC2D4S0                       3038
#define CLC2SEL3_D4S                  3039
#define CLC2SEL3_D4S1                 3040
#define LC2D4S1                       3041
#define CLC2SEL3_D4S2                 3042
#define LC2D4S2                       3043
#define CLC2SEL3_D4S3                 3044
#define LC2D4S3                       3045
#define CLC2SEL3_D4S4                 3046
#define LC2D4S4                       3047
#define CLC2SEL3_D4S5                 3048
#define LC2D4S5                       3049
#define CLC2SEL3_D4S6                 3050
#define LC2D4S6                       3051
#define CLC2SEL3_D4S7                 3052
#define LC2D4S7                       3053
#define CLC2GLS0                      3054
#define LC2G1D1N                      3055
#define CLC2GLS0_D1N                  3056
#define CLC2GLS0_D1T                  3057
#define LC2G1D1T                      3058
#define LC2G1D2N                      3059
#define CLC2GLS0_D2N                  3060
#define CLC2GLS0_D2T                  3061
#define LC2G1D2T                      3062
#define LC2G1D3N                      3063
#define CLC2GLS0_D3N                  3064
#define CLC2GLS0_D3T                  3065
#define LC2G1D3T                      3066
#define LC2G1D4N                      3067
#define CLC2GLS0_D4N                  3068
#define CLC2GLS0_D4T                  3069
#define LC2G1D4T                      3070
#define CLC2GLS1                      3071
#define CLC2GLS1_D1N                  3072
#define LC2G2D1N                      3073
#define CLC2GLS1_D1T                  3074
#define LC2G2D1T                      3075
#define CLC2GLS1_D2N                  3076
#define LC2G2D2N                      3077
#define CLC2GLS1_D2T                  3078
#define LC2G2D2T                      3079
#define LC2G2D3N                      3080
#define CLC2GLS1_D3N                  3081
#define LC2G2D3T                      3082
#define CLC2GLS1_D3T                  3083
#define LC2G2D4N                      3084
#define CLC2GLS1_D4N                  3085
#define LC2G2D4T                      3086
#define CLC2GLS1_D4T                  3087
#define CLC2GLS2                      3088
#define LC2G3D1N                      3089
#define CLC2GLS2_D1N                  3090
#define CLC2GLS2_D1T                  3091
#define LC2G3D1T                      3092
#define CLC2GLS2_D2N                  3093
#define LC2G3D2N                      3094
#define LC2G3D2T                      3095
#define CLC2GLS2_D2T                  3096
#define CLC2GLS2_D3N                  3097
#define LC2G3D3N                      3098
#define CLC2GLS2_D3T                  3099
#define LC2G3D3T                      3100
#define CLC2GLS2_D4N                  3101
#define LC2G3D4N                      3102
#define LC2G3D4T                      3103
#define CLC2GLS2_D4T                  3104
#define CLC2GLS3                      3105
#define LC2G4D1N                      3106
#define CLC2GLS3_G4D1N                3107
#define CLC2GLS3_G4D1T                3108
#define LC2G4D1T                      3109
#define CLC2GLS3_G4D2N                3110
#define LC2G4D2N                      3111
#define LC2G4D2T                      3112
#define CLC2GLS3_G4D2T                3113
#define CLC2GLS3_G4D3N                3114
#define LC2G4D3N                      3115
#define CLC2GLS3_G4D3T                3116
#define LC2G4D3T                      3117
#define LC2G4D4N                      3118
#define CLC2GLS3_G4D4N                3119
#define CLC2GLS3_G4D4T                3120
#define LC2G4D4T                      3121
#define CLC3CON                       3122
#define LC3MODE                       3123
#define CLC3CON_MODE0                 3124
#define LC3MODE0                      3125
#define CLC3CON_MODE                  3126
#define CLC3CON_MODE1                 3127
#define LC3MODE1                      3128
#define CLC3CON_MODE2                 3129
#define LC3MODE2                      3130
#define LC3INTN                       3131
#define CLC3CON_INTN                  3132
#define LC3INTP                       3133
#define CLC3CON_INTP                  3134
#define LC3OUT                        3135
#define CLC3CON_OUT                   3136
#define LC3EN                         3137
#define CLC3CON_EN                    3138
#define CLC3POL                       3139
#define LC3G1POL                      3140
#define CLC3POL_G1POL                 3141
#define LC3G2POL                      3142
#define CLC3POL_G2POL                 3143
#define CLC3POL_G3POL                 3144
#define LC3G3POL                      3145
#define LC3G4POL                      3146
#define CLC3POL_G4POL                 3147
#define LC3POL                        3148
#define CLC3POL_POL                   3149
#define CLC3SEL0                      3150
#define LC3D1S                        3151
#define CLC3SEL0_D1S                  3152
#define LC3D1S0                       3153
#define CLC3SEL0_D1S0                 3154
#define LC3D1S1                       3155
#define CLC3SEL0_D1S1                 3156
#define LC3D1S2                       3157
#define CLC3SEL0_D1S2                 3158
#define LC3D1S3                       3159
#define CLC3SEL0_D1S3                 3160
#define LC3D1S4                       3161
#define CLC3SEL0_D1S4                 3162
#define LC3D1S5                       3163
#define CLC3SEL0_D1S5                 3164
#define LC3D1S6                       3165
#define CLC3SEL0_D1S6                 3166
#define LC3D1S7                       3167
#define CLC3SEL0_D1S7                 3168
#define CLC3SEL1                      3169
#define LC3D2S0                       3170
#define LC3D2S                        3171
#define CLC3SEL1_D2S0                 3172
#define CLC3SEL1_D2S                  3173
#define LC3D2S1                       3174
#define CLC3SEL1_D2S1                 3175
#define LC3D2S2                       3176
#define CLC3SEL1_D2S2                 3177
#define LC3D2S3                       3178
#define CLC3SEL1_D2S3                 3179
#define LC3D2S4                       3180
#define CLC3SEL1_D2S4                 3181
#define LC3D2S5                       3182
#define CLC3SEL1_D2S5                 3183
#define LC3D2S6                       3184
#define CLC3SEL1_D2S6                 3185
#define LC3D2S7                       3186
#define CLC3SEL1_D2S7                 3187
#define CLC3SEL2                      3188
#define LC3D3S                        3189
#define CLC3SEL2_D3S                  3190
#define LC3D3S0                       3191
#define CLC3SEL2_D3S0                 3192
#define LC3D3S1                       3193
#define CLC3SEL2_D3S1                 3194
#define LC3D3S2                       3195
#define CLC3SEL2_D3S2                 3196
#define LC3D3S3                       3197
#define CLC3SEL2_D3S3                 3198
#define LC3D3S4                       3199
#define CLC3SEL2_D3S4                 3200
#define LC3D3S5                       3201
#define CLC3SEL2_D3S5                 3202
#define LC3D3S6                       3203
#define CLC3SEL2_D3S6                 3204
#define LC3D3S7                       3205
#define CLC3SEL2_D3S7                 3206
#define CLC3SEL3                      3207
#define CLC3SEL3_D4S                  3208
#define LC3D4S0                       3209
#define LC3D4S                        3210
#define CLC3SEL3_D4S0                 3211
#define LC3D4S1                       3212
#define CLC3SEL3_D4S1                 3213
#define LC3D4S2                       3214
#define CLC3SEL3_D4S2                 3215
#define LC3D4S3                       3216
#define CLC3SEL3_D4S3                 3217
#define LC3D4S4                       3218
#define CLC3SEL3_D4S4                 3219
#define LC3D4S5                       3220
#define CLC3SEL3_D4S5                 3221
#define LC3D4S6                       3222
#define CLC3SEL3_D4S6                 3223
#define LC3D4S7                       3224
#define CLC3SEL3_D4S7                 3225
#define CLC3GLS0                      3226
#define CLC3GLS0_D1N                  3227
#define LC3G1D1N                      3228
#define LC3G1D1T                      3229
#define CLC3GLS0_D1T                  3230
#define LC3G1D2N                      3231
#define CLC3GLS0_D2N                  3232
#define CLC3GLS0_D2T                  3233
#define LC3G1D2T                      3234
#define CLC3GLS0_D3N                  3235
#define LC3G1D3N                      3236
#define LC3G1D3T                      3237
#define CLC3GLS0_D3T                  3238
#define CLC3GLS0_D4N                  3239
#define LC3G1D4N                      3240
#define CLC3GLS0_D4T                  3241
#define LC3G1D4T                      3242
#define CLC3GLS1                      3243
#define LC3G2D1N                      3244
#define CLC3GLS1_D1N                  3245
#define CLC3GLS1_D1T                  3246
#define LC3G2D1T                      3247
#define LC3G2D2N                      3248
#define CLC3GLS1_D2N                  3249
#define LC3G2D2T                      3250
#define CLC3GLS1_D2T                  3251
#define LC3G2D3N                      3252
#define CLC3GLS1_D3N                  3253
#define CLC3GLS1_D3T                  3254
#define LC3G2D3T                      3255
#define LC3G2D4N                      3256
#define CLC3GLS1_D4N                  3257
#define LC3G2D4T                      3258
#define CLC3GLS1_D4T                  3259
#define CLC3GLS2                      3260
#define LC3G3D1N                      3261
#define CLC3GLS2_D1N                  3262
#define LC3G3D1T                      3263
#define CLC3GLS2_D1T                  3264
#define CLC3GLS2_D2N                  3265
#define LC3G3D2N                      3266
#define CLC3GLS2_D2T                  3267
#define LC3G3D2T                      3268
#define CLC3GLS2_D3N                  3269
#define LC3G3D3N                      3270
#define LC3G3D3T                      3271
#define CLC3GLS2_D3T                  3272
#define CLC3GLS2_D4N                  3273
#define LC3G3D4N                      3274
#define CLC3GLS2_D4T                  3275
#define LC3G3D4T                      3276
#define CLC3GLS3                      3277
#define LC3G4D1N                      3278
#define CLC3GLS3_G4D1N                3279
#define LC3G4D1T                      3280
#define CLC3GLS3_G4D1T                3281
#define LC3G4D2N                      3282
#define CLC3GLS3_G4D2N                3283
#define CLC3GLS3_G4D2T                3284
#define LC3G4D2T                      3285
#define LC3G4D3N                      3286
#define CLC3GLS3_G4D3N                3287
#define CLC3GLS3_G4D3T                3288
#define LC3G4D3T                      3289
#define LC3G4D4N                      3290
#define CLC3GLS3_G4D4N                3291
#define LC3G4D4T                      3292
#define CLC3GLS3_G4D4T                3293
#define CLC4CON                       3294
#define LC4MODE                       3295
#define CLC4CON_MODE                  3296
#define LC4MODE0                      3297
#define CLC4CON_MODE0                 3298
#define LC4MODE1                      3299
#define CLC4CON_MODE1                 3300
#define LC4MODE2                      3301
#define CLC4CON_MODE2                 3302
#define LC4INTN                       3303
#define CLC4CON_INTN                  3304
#define CLC4CON_INTP                  3305
#define LC4INTP                       3306
#define CLC4CON_OUT                   3307
#define LC4OUT                        3308
#define CLC4CON_EN                    3309
#define LC4EN                         3310
#define CLC4POL                       3311
#define CLC4POL_G1POL                 3312
#define LC4G1POL                      3313
#define CLC4POL_G2POL                 3314
#define LC4G2POL                      3315
#define CLC4POL_G3POL                 3316
#define LC4G3POL                      3317
#define LC4G4POL                      3318
#define CLC4POL_G4POL                 3319
#define LC4POL                        3320
#define CLC4POL_POL                   3321
#define CLC4SEL0                      3322
